In [2]:
import numpy as np
import pandas as pd

- merging two table is called joining.

## TYPES OF JOINS

![joins](./img/joins.png)

### INNER JOIN

will bring the same rows based on paricular column

![inner join](./img/inner_join.png)

In [ ]:
left_table = {'Date': ['1/1/2020', '1/2/2020', '1/3/2020', '1/4/2020'] ,
             'CountryID': [1,1,3,2],
             'Units': [40, 25, 30, 35]}

In [ ]:
left_table_df = pd.DataFrame(left_table)
left_table_df

In [ ]:
right_table =  {'ID': [3,4],
               'Country': ['Panama', 'Spain']}

In [ ]:
right_table_df = pd.DataFrame(right_table)
right_table_df

In [ ]:
#by defualt inner join
left_table_df.merge(right_table_df,
                    how='inner',
                    left_on='CountryID',
                    right_on='ID').drop('ID', axis=1)

### `LEFT` / `LEFT OUTER` JOIN

- All rows from left table but matching rows from right table

![left join](./img/left_join.png)

In [ ]:
left_table = {'Date': ['1/1/2020', '1/2/2020', '1/3/2020', '1/4/2020'] ,
             'CountryID': [1,1,3,4],
             'Units': [40, 25, 30, 35]}

left_table_df = pd.DataFrame(left_table)
left_table_df

In [ ]:
right_table =  {'ID': [1, 2, 3],
               'Country': ['USA', 'Canada', 'Panama']}

right_table_df = pd.DataFrame(right_table)
right_table_df

In [ ]:
left_table_df.merge(right_table_df,
                    how='left',
                    left_on='CountryID',
                    right_on='ID').drop('ID', axis=1)

### `RIGHT` / `RIGHT OUTER` JOIN

- All rows from right tble but matching ros from left table

![right table](./img/right_join.png)

In [ ]:
left_table = {'Date': ['1/1/2020', '1/2/2020', '1/3/2020', '1/4/2020'] ,
             'CountryID': [1,1,3,4],
             'Units': [40, 25, 30, 35]}

left_table_df = pd.DataFrame(left_table)
left_table_df

In [ ]:
right_table =  {'ID': [3],
               'Country': ['Panama']}

right_table_df = pd.DataFrame(right_table)
right_table_df

In [ ]:
left_table_df.merge(right_table_df,
                    how='right',
                    left_on='CountryID',
                    right_on='ID').drop('ID', axis=1)

### `FULL`/ `OUTER` JOIN

- All rows from both tables

![full](./img/full_outer_join.png)

In [ ]:
left_table = {'Date': ['1/1/2020', '1/2/2020', '1/3/2020', '1/4/2020'] ,
             'CountryID': [1,1,3,2],
             'Units': [40, 25, 30, 35]}

left_table_df = pd.DataFrame(left_table)
left_table_df

In [ ]:
right_table =  {'ID': [1,2,3, 4],
               'Country': ['USA', 'Canada', 'Panama', 'Spain']}

right_table_df = pd.DataFrame(right_table)
right_table_df

In [ ]:
left_table_df.merge(right_table_df,
                    how='outer',
                    left_on='CountryID',
                    right_on='ID').drop('ID', axis=1)

### LEFT ANTI JOIN

- Only Rows from left table that are not matching.

![](./img/left_anti_join.png)

In [7]:
left_table = {'Date': ['1/1/2020', '1/2/2020', '1/3/2020', '1/4/2020'] ,
             'CountryID': [1,1,3,2],
             'Units': [40, 25, 30, 35]}

left_table_df = pd.DataFrame(left_table)
left_table_df

       Date  CountryID  Units
0  1/1/2020          1     40
1  1/2/2020          1     25
2  1/3/2020          3     30
3  1/4/2020          2     35

In [8]:
right_table =  {'ID': [3,4],
               'Country': ['Panama','Spain']}

right_table_df = pd.DataFrame(right_table)
right_table_df

   ID Country
0   3  Panama
1   4   Spain

- STEP:1 For left anti simply merge yhe table with left join with params `indicator=True`
- STEP:2 Create a filter for left_ony rows
- STEP:3 Apply that filter on whole dataset

In [9]:
left_anti_df = left_table_df.merge(right_table_df,
                                    how='left',
                                    left_on='CountryID',
                                    right_on='ID',
                                    indicator=True).drop('ID', axis=1)

In [10]:
left_anti_df[left_anti_df['_merge'] == 'left_only'].drop('_merge', axis=1)

       Date  CountryID  Units Country
0  1/1/2020          1     40     NaN
1  1/2/2020          1     25     NaN
3  1/4/2020          2     35     NaN

### RIGHT ANTI JOIN

- All rows from RIGHT table that are not macthing with left table.

![right anti join](./img/right_anti_join.png)

In [11]:
left_table = {'Date': ['1/1/2020', '1/2/2020', '1/3/2020', '1/4/2020'] ,
             'CountryID': [1,1,3,2],
             'Units': [40, 25, 30, 35]}

left_table_df = pd.DataFrame(left_table)
left_table_df

       Date  CountryID  Units
0  1/1/2020          1     40
1  1/2/2020          1     25
2  1/3/2020          3     30
3  1/4/2020          2     35

In [12]:
right_table =  {'ID': [3,4],
               'Country': ['Panama','Spain']}

right_table_df = pd.DataFrame(right_table)
right_table_df

   ID Country
0   3  Panama
1   4   Spain

- STEP:1 For `right anti` simply merge yhe table with `right join` with params `indicator=True`
- STEP:2 Create a filter for left_ony rows
- STEP:3 Apply that filter on whole dataset

In [13]:
right_anti_df = left_table_df.merge(right_table_df,
                                    how='right',
                                    left_on='CountryID',
                                    right_on='ID',
                                    indicator=True).drop('ID', axis=1)

In [14]:
right_anti_df[left_anti_df['_merge'] == 'right_only'].drop('_merge', axis=1)

C:\Users\smit\AppData\Local\Temp\ipykernel_9964\3635338087.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  right_anti_df[left_anti_df['_merge'] == 'right_only'].drop('_merge', axis=1)

Empty DataFrame
Columns: [Date, CountryID, Units, Country]
Index: []

### `LEFT SEMI` JOINS

- STEP:1 Return the `intersection`, similar to an `inner join`
- STEP:2 Return only column from `left table` and not the rigth
- STEP:3 `No duplicated`

In [3]:
left_table = {'Date': ['1/1/2020', '1/2/2020', '1/3/2020', '1/4/2020'] ,
             'CountryID': [1,1,3,2],
             'Units': [40, 25, 30, 35]}

left_table_df = pd.DataFrame(left_table)
left_table_df

       Date  CountryID  Units
0  1/1/2020          1     40
1  1/2/2020          1     25
2  1/3/2020          3     30
3  1/4/2020          2     35

In [4]:
right_table =  {'ID': [1,3,4],
               'Country': ['USA', 'Panama','Spain']}

right_table_df = pd.DataFrame(right_table)
right_table_df

   ID Country
0   1     USA
1   3  Panama
2   4   Spain

In [ ]:
left_semi_join = left_table_df.merge(right_table_df,
                    left_on='CountryID',
                    right_on='ID').drop('ID', axis=1)

In [ ]:
left_semi_join

In [ ]:
left_semi_join[['Date',
                'CountryID',
                'Units']].drop_duplicates(subset='CountryID')

### `RIGHT SEMI` JOINS

- STEP:1 Return the `intersection`, similar to an `inner join`
- STEP:2 Return only column from `right table` and not the left
- STEP:3 `No duplicated`

In [ ]:
right_semi_join = left_table_df.merge(right_table_df,
                    left_on='CountryID',
                    right_on='ID').drop('CountryID', axis=1)

In [ ]:
right_semi_join

In [ ]:
right_semi_join[['ID',
                'Country']].drop_duplicates(subset='ID')

### SOMTHING MORE

In [6]:
left_table_df.merge(right_table_df,
                    left_on='CountryID',
                    right_on='ID',
                    suffixes=('_x', '_y'))

       Date  CountryID  Units  ID Country
0  1/1/2020          1     40   1     USA
1  1/2/2020          1     25   1     USA
2  1/3/2020          3     30   3  Panama

## CONCATENATION

In [15]:
left_anti_df

       Date  CountryID  Units Country     _merge
0  1/1/2020          1     40     NaN  left_only
1  1/2/2020          1     25     NaN  left_only
2  1/3/2020          3     30  Panama       both
3  1/4/2020          2     35     NaN  left_only

In [16]:
right_anti_df

       Date  CountryID  Units Country      _merge
0  1/3/2020        3.0   30.0  Panama        both
1       NaN        NaN    NaN   Spain  right_only

In [18]:
pd.concat([left_anti_df, right_anti_df], ignore_index=True)

       Date  CountryID  Units Country      _merge
0  1/1/2020        1.0   40.0     NaN   left_only
1  1/2/2020        1.0   25.0     NaN   left_only
2  1/3/2020        3.0   30.0  Panama        both
3  1/4/2020        2.0   35.0     NaN   left_only
4  1/3/2020        3.0   30.0  Panama        both
5       NaN        NaN    NaN   Spain  right_only

### Thats it